import { memo } from 'react'

import styles from './ModInfo.module.scss'

export const ModInfo = memo(() => {
  return (
    <section>
      <div className={styles.container}>
        <div className={styles.paragraph}>
          <p className={styles.header}>
            Усі консолі, придбані у нас, спеціальним чином модифіковані, що відкриває для вас
            великий спектр можливостей. До прикладу декілька із них:
          </p>
          <ul className={styles.list}>
            <li>
              Безкоштовне завантаження ігор через Wi-Fi, із додатка "Tinfoil", котрий налічує
              бібліотеку ~4000.
            </li>
            <li>Встановлення фанатських локалізацій на ігри, в тому числі з українською мовою.</li>
            <li>
              Встановлення емуляторів ретро консолей, таких як NES, SNES, N64, GBA, SEGA, PSP, PS1
              тощо.
            </li>
            <li>
              Можливість встановити додаткові операційні системи як Android, Android TV, Linux.
            </li>
            <li>Покращення графіки в іграх за рахунок фанатських модів.</li>
            <li>
              Покращення продуктивності консолі шляхом розгону оперативної пам'яті, центрального та
              графічного процесора.
            </li>
            <li>Можливість використовувати геймпади інших виробників(PS, XBOX).</li>
            <li>
              Використання різних плагінів, котрі поліпшать ваш досвід користування з консоллю
              (Наприклад можна вивести різну метрику на екран консолі, як температура, навантаження,
              стан акумулятора, споживання енергій в реальному часі, відображення кількості кадрів.
              Або можна скоригувати зображення, зробити його світлішим або більш насиченим, змінити
              відтінок. Можна обмежити відсоток заряджання акумулятора, або взагалі його відключити
              та грати на пряму від блоку живлення і багато чого іншого.)
            </li>
          </ul>
        </div>
      </div>
    </section>
  )
})
