export const reviews: Review[] = [
  {
    comment: 'Гарне обслуговування',
    date: new Date(2024, 6, 18),
    name: 'Андрій',
    rating: 5,
  },
  {
    comment:
      'Приставка пришла в соответсвии с описанием. Все работает отлично. Продавец ответил на все вопросы и дал необходимые инструкции для пользования консолью. Рекомендую.',
    date: new Date(2024, 6, 13),
    name: 'Владислав',
    rating: 5,
  },
  {
    comment:
      'Людина терпілива і ввічлива, був прикрий випадок на нп переплутали закази, но Юрій зробив все можливе і неможливе що б виправити цю ситуацію. Терпіливо витримав всі мої нападки і надав допомогу як міг хоча я і звинувачував його. Знається на своїй справі і допомогає незважаючи не на що. Дякую.',
    date: new Date(2024, 5, 17),
    name: 'Вадим',
    rating: 5,
  },
  {
    comment:
      "Гарне обслуговування, актуальний опис, швидко зв'язалися, швидко відправили, ввічливий продавець, актуальна ціна, товар був у наявності",
    date: new Date(2024, 5, 11),
    name: 'Віталій',
    rating: 5,
  },
  {
    comment:
      "Гарне обслуговування, актуальний опис, швидко зв'язалися, швидко відправили, ввічливий продавець, актуальна ціна, товар був у наявності",
    date: new Date(2024, 4, 18),
    name: 'Дмитрий',
    rating: 5,
  },
  {
    comment:
      "Гарне обслуговування, актуальний опис, швидко зв'язалися, швидко відправили, ввічливий продавець, товар був у наявності",
    date: new Date(2024, 4, 16),
    name: 'Сергей',
    rating: 5,
  },
  {
    comment: 'швидко та все як і обіцяв. без обману',
    date: new Date(2024, 4, 16),
    name: 'Дмитрий',
    rating: 5,
  },
  {
    comment:
      "Гарне обслуговування, актуальний опис, швидко зв'язалися, швидко відправили, ввічливий продавець, актуальна ціна, товар був у наявності",
    date: new Date(2024, 3, 28),
    name: 'Олена',
    rating: 5,
  },
]

type Review = {
  comment: string
  date: Date
  name: string
  rating: number
}
